Repository: GLolol/apt-listchanges
Catalog: po/*.po
Languages: fi

source: Must specify either --apt or filenames to process!
fi: Annettava joko valitsin --apt tai k‰sitelt‰vien tiedostojen nimet!

source: Unable to determine package name for %s
fi: Paketin nimen m‰‰ritys tiedostolle %s ei onnistunut

source: Unable to determine version for %s
fi: Version m‰‰ritys tiedostolle %s ei onnistunut

source: Unable to determine source package name for %s
fi: L‰hdekoodipaketin nimen m‰‰ritys tiedostolle %s ei onnistunut

source: %s: will be newly installed
fi: %s on uusi asennus

source: %s: Version $version is already installed
fi: Paketin %s versio $version on jo asennettu

source: %s: Version %s is older than installed version (%s)
fi: Paketin %s versio %s on vanhempi kuin asennetun versio (%s)

source: Changes for %s
fi: Muutokset pakettiin %s

source: Informational notes
fi: Tiedotukset

source: Error output follows
fi: Virheilmoitukset

source: In order to use the newt frontend, you must install libnewt-perl
fi: Sinun on asennettava libnewt-perl, jotta newt-liittym‰ toimisi

source: Reading changelogs
fi: Luen muutoslokeja

source: Scanning packages...
fi: Selaan pakettilistaa...

source: Displaying changelogs
fi: Muutoslokien n‰yttˆ

source: Reading changelogs...%s
fi: Luen muutoslokeja...%s

source: Done
fi: Valmis

source: Unable to open tty for confirmation, assuming yes
fi: Vahvistuksen luku p‰‰tteelt‰ ep‰onnistui, oletan vahvistetuksi

source: Do you want to continue [Y/n]?
fi: Haluatko jatkaa [Kyll‰=y/ei=n]?

source: Unable to open temporary file %s: $!
fi: Tilap‰istiedoston %s avaus ep‰onnistui: $!

source: Changelogs mailed to %s
fi: Muutoslokit l‰hetetty osoitteeseen %s

source: Wrong or missing VERSION from apt pipeline
fi: VERSION virheellinen tai puuttuu apt:n tulosteesta

source: (is Dpkg::Tools::Options::/usr/bin/apt-listchanges::Version set to 2?)
fi: (onko Dpkg::Tools::Options::/usr/bin/apt-listchanges::Version arvoltaan 2?)
