Repository: GLolol/apt-listchanges
Catalog: debian/po/*.po
Languages: fi, pt_pt

source: pager
fi: sivutin

source: browser
fi: selain

source: xterm-pager
fi: xterm-sivutin

source: xterm-browser
fi: xterm-selain

source: text
fi: teksti

source: mail
fi: sähköposti

source: none
fi: ei mikään

source: Method for changes display:
fi: Muutosten näyttötapa:

source: apt-listchanges can display package changes in a number of different ways.
fi: apt-listchanges osaa näyttää pakettien muutokset usealla eri tavalla.
pt_pt: O apt-listchanges pode mostrar modificações nos pacotes através de diferentes modos.

source: This setting can be overridden by a command-line option or an environment variable. Note that you can still send a copy via mail with all of the frontends except 'none'.
fi: Tämä asetus voi syrjäyttää komentorivivalitsimen tai ympäristömuuttujan. Huomaa, että voit edelleen lähettää kopion postista kaikissa muissa liittymissä paitsi "ei mikään".
pt_pt: Esta opção pode ser ultrapassada através de uma opção em comando de linha ou através de uma variável de ambiente. Note que pode sempre enviar uma cópia via mail em todas as opções excepto na opção nenhum.

source: E-mail Address(es) which will receive changes:
fi: Sähköpostiosoite(et), joihin muutokset lähetetään:

source: apt-listchanges can email a copy of displayed changes. Please enter the email address the changes should be sent to.
fi: apt-listchanges voi lähettää muutoksista kopion sähköpostissa. Syötä osoitteet, joihin haluat muutokset lähetettävän.

source: Multiple addresses may be specified, delimited by commas. Leave this empty if you do not want any email to be sent.
fi: Pilkulla erottelemalla voit antaa useita osoitteita. Jätä tämä kohta tyhjäksi, jos et halua sähköpostia lähetettävän.
pt_pt: Podem ser especificados múltiplos endereços, delimitados por vírgulas. Deixe este espaço vazio se não quiser que seja enviado qualquer email.

source: Prompt for confirmation after displaying changes?
fi: Kysytäänkö vahvistusta muutoksien näytön jälkeen?

source: After giving you a chance to read the list of changes, apt-listchanges can ask whether or not you would like to continue. This is useful when running from apt, as it gives you a chance to abort the upgrade if you see a change you do not want to apply (yet).
fi: Luettuasi muutosluettelon, apt-listchanges voi kysyä muutoslokien näyttämisen jälkeen haluatko jatkaa asennusta. Tästä on hyötyä aptin tekemässä automaattiajossa, koska saat mahdollisuuden keskeyttää päivityksen, jos et halua (vielä) tehdä jotain näkemääsi muutosta.
pt_pt: Depois de lhe possibilidade de ler a lista de modificações, o apt-listchanges pode pedir-lhe se quer ou não continuar. Está função é útil que se encontra a correr o apt, já que lhe ofereçe uma possibilidade de cancelar a actualização se detectar uma modificação que não queira aplicar na altura.

source: This setting does not apply to the 'mail' or 'none' frontends, and can be overridden with a command line option.
fi: Tätä asetusta ei huomioida "posti"- ja "ei mikään"-liittymissä. Asetuksen voi myös ohittaa komentorivivalitsimella.
pt_pt: Esta configuração não se aplica às opções 'mail' ou 'nenhum', e pode ser alterada através de uma opção em linha de comando.

source: Should apt-listchanges skip changes that have already been seen?
fi: Haluatko apt-listchangesin ohittavan jo nähdyt muutokset?
pt_pt: Deverá o apt-listchanges ignorar as modificações que tenham já sido visualizadas?

source: apt-listchanges has the capability to keep track of which changes have already been displayed, and to skip them in future invocations. This is useful, for example, when retrying an upgrade.
fi: apt-listchanges voi pitää kirjaa jo näytetyistä muutoksista ja jättää nämä näyttämättä myöhemmin. Tästä on hyötyä esimerkiksi yritettäessä päivitystä uudelleen.
pt_pt: O apt-listchanges possui a capacidade de guardar o historial de modificações que tenham já sido visualizadas, e ignorá-las em futuras solicitações. Esta função é útil por exemplo quando se volta a tentar uma actualização.

source: news, both, changelogs
fi: uutiset, molemmat, muutoslokit
pt_pt: novidades, ambos, relatórios de modificações

source: Changes displayed with apt:
fi: APTin ajossa näytettävät muutokset:

source: Please choose which type of changes should be displayed with APT.
fi: Valitse minkä tyyppiset muutokset näytetään APTin ajon yhteydessä.

source: news - important news items only both - both news and detailed changelogs changelogs - detailed changelogs only
fi: uutiset - ainoastaan tärkeät uutiset molemmat - sekä uutiset että tarkat muutoslokit muutoslokit - ainoastaan tarkat muutoslokit
pt_pt: novidades - apenas novos elementos importantes ambos - ambas as novidades e os relatórios de alterações detalhados relatórios de alterações - apenas relatórios detalhados

source: pager, browser, xterm-pager, xterm-browser, text, mail, none
pt_pt: pager, browser, xterm-pager, xterm-browser, texto, mail, nenhum

source: How should changes be displayed with apt?
pt_pt: Como deverão ser visualizadas as modificações com o apt?

source: pager - Use your preferred pager to display changes one page at a time
pt_pt: pager - Utilizar o seu pager preferido para visualizar modificações, uma página de cada vez

source: browser - Display HTML-formatted changes using a web browser
pt_pt: browser - Visualizar as actualizações em formato HTML utilizando um browser web

source: xterm-pager - Like pager, but in an xterm in the background
pt_pt: xterm-pager - Tal como num pager, mas tendo uma consola xterm como background

source: xterm-browser - Like browser, but in an xterm in the background
pt_pt: xterm-browser - Tal como num browser, mas tendo uma consola xterm como background

source: text - Print changes to your terminal (without pausing)
pt_pt: texto - Visualizar as modificações no seu terminal (sem pausas)

source: mail - Only send changes via mail
pt_pt: mail - Apenas envia lista de modificações via email

source: none - Do not run automatically from apt
pt_pt: nenhum - Não corre automáticamente a partir do apt

source: To whom should apt-listchanges mail changes?
pt_pt: Para que mail devem ser enviadas as modificações do apt-listchanges?

source: apt-listchanges can email a copy of displayed changes. To what email address should they be sent?
pt_pt: O apt-listchanges pode enviar uma cópia em email das modificações visualizadas. Para que endereço de email deverão ser estas enviadas?

source: Should apt-listchanges prompt for confirmation after displaying changes?
pt_pt: Deverá o apt-listchanges pedir confirmação após mostrar as modificações?

source: Which types of changes should be displayed with apt?
pt_pt: Que tipos de modificações deverão ser visualizadas com o apt?
